# 여러 dataframe 하나로 병합하기
> 데이터를 다루다 보면 하나의 dataframe을 여러 개로 나누거나 다시 합쳐야 하는 일이 많이 발생한다. 다음은 column 수가 같은 서로 다른 데이터프레임들을 하나로 합칠 때 사용하는 방법이다.

In [1]:
# 라이브러리 불러오기
import pandas as pd

In [2]:
# 샘플 데이터 만들기
df1 = pd.DataFrame(data={'col1':[1,2,3], 'col2':[10,11,12], 'col3':[100,101,102]})
df2 = pd.DataFrame(data={'col1':[4,5,6], 'col2':[13,14,15], 'col3':[103,104,105]})
df3 = pd.DataFrame(data={'col1':[7,8,9], 'col2':[16,17,18], 'col3':[106,107,108]})
df4 = pd.DataFrame(data={'col1':[10,11,12], 'col2':[19,20,21], 'col3':[109, 110, 111]})

In [3]:
df1

   col1  col2  col3
0     1    10   100
1     2    11   101
2     3    12   102

In [4]:
df2

   col1  col2  col3
0     4    13   103
1     5    14   104
2     6    15   105

In [5]:
df3

   col1  col2  col3
0     7    16   106
1     8    17   107
2     9    18   108

In [6]:
df4

   col1  col2  col3
0    10    19   109
1    11    20   110
2    12    21   111

In [10]:
# 모든 데이터프레임 합치기
df_li = [df1, df2, df3, df4]
total_df = pd.concat(df_li)
total_df

   col1  col2  col3
0     1    10   100
1     2    11   101
2     3    12   102
0     4    13   103
1     5    14   104
2     6    15   105
0     7    16   106
1     8    17   107
2     9    18   108
0    10    19   109
1    11    20   110
2    12    21   111